cfe llm/DataProcessors/AI_НовоеДействие.xml
<?xml version="1.0" encoding="utf-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>AI_НовоеДействие</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

cfe llm/Enums/AI_ТипЗначенияПоля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_ТипЗначенияПоля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Число</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Булево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ссылка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/Enums/AI_ВидДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>AI_ВидДействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТолькоПоказать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнитьФорму</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписатьОбъект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПользовательскоеДействие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВнешнийОбработчик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоздатьОбъект</Name>				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe llm/Catalogs/AI_КартыИзвлечения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_КартыИзвлечения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеИмяМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаменятьСтрокиТабличныхЧастей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поля</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗначения</Name>
							<Type>
								<v8:Type>d5p1:EnumRef.AI_ТипЗначенияПоля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСсылки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПутьРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоискПоНаименованию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательное</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подсказка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТабличнаяЧасть</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДополнительныйРеквизит</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыбиратьИзСписка</Name>							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<Attribute>
				<Properties>
					<Name>ОбновлятьСтрокиПоНомеру</Name>					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/Catalogs/AI_Сценарии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>AI_Сценарии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Агенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AI_Модели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипAPI</Name>					<Type>
						<v8:Type>cfg:EnumRef.AI_ТипAPI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияКонтракта</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаОтветаJSON</Name>					<Comment /><Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
					<FillFromFillingValue>false</FillFromFillingValue>				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПовтор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимумПопыток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляСтаройОчереди</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособРазбораВложений</Name>
					<Type>
						<v8:Type>d5p1:EnumRef.AI_СпособРазбораВложений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe llm/DataProcessors/AI_НовоеДействие/Forms/Форма/Ext/Form/Module.bsl
// Мастер «Новое AI-действие». Пять шагов вопросов и итог: форма собирает
// ответы и заранее показывает последствия, а создает все модуль менеджера
// обработки — одной транзакцией.

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Описание = Обработки.AI_НовоеДействие.НовоеОписание();
	ТипМестаМастера = Описание.ТипМеста;
	ИсточникДанных = Описание.ИсточникДанных;
	РежимДиалога = Описание.РежимДиалога;
	ВидРезультата = ВидРезультатаПоОписанию(Описание);
	РежимСтрок = Описание.РежимСтрок;
	РазрешитьПачку = Описание.РазрешитьПачку;
	ОбразецСценария = Описание.ОбразецСценария;
	Включить = Описание.Включить;

	// Пояснения в одну узкую колонку читаются плохо: пусть занимают всю ширину.
	Для Каждого ИмяНадписи Из СтрРазделить("ПояснениеОбъект,ПояснениеНазвания,ДействияОбъекта,"
		+ "ПояснениеДанные,ПояснениеФайла,ПояснениеДиалога,ПояснениеРезультат,ПояснениеКарты,"
		+ "ПояснениеДействие,ПояснениеПачки,ПредупреждениеПачки,ПояснениеСценария,ПояснениеИтог,"
		+ "ТекстИтога,ТекстПредупреждений,ПояснениеКоманды,ТекстГотово,ТекстПроблем", ",") Цикл
		Элементы[ИмяНадписи].РастягиватьПоГоризонтали = Истина;
		Элементы[ИмяНадписи].АвтоМаксимальнаяШирина = Ложь;
	КонецЦикла;
	Элементы.ПредупреждениеПачки.ЦветТекста = ЦветПредупреждения();
	Элементы.ТекстПредупреждений.ЦветТекста = ЦветПредупреждения();
	// Запрос — несколько строк; растянутое на весь экран поле выглядит так,
	// будто от администратора ждут сочинение.
	Элементы.НачальныйЗапрос.РастягиватьПоВертикали = Ложь;

	Если ЗначениеЗаполнено(Параметры.ПолноеИмяМетаданных)
		И Метаданные.НайтиПоПолномуИмени(Параметры.ПолноеИмяМетаданных) <> Неопределено Тогда
		УстановитьОбъект(Параметры.ПолноеИмяМетаданных);
	КонецЕсли;
	ПоказатьШаг(Элементы.ШагОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПредставлениеОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Варианты = ВариантыОбъектовНаСервере();
	Варианты.ПоказатьВыборЭлемента(
		Новый ОписаниеОповещения("ВыборОбъектаЗавершение", ЭтотОбъект),
		"Выберите объект",
		Варианты.НайтиПоЗначению(ПолноеИмяМетаданных));

КонецПроцедуры

&НаКлиенте
Процедура ВыборОбъектаЗавершение(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт

	Если ВыбранныйЭлемент = Неопределено Или ВыбранныйЭлемент.Значение = ПолноеИмяМетаданных Тогда
		Возврат;
	КонецЕсли;
	УстановитьОбъектНаСервере(ВыбранныйЭлемент.Значение);

КонецПроцедуры

// Объектов в конфигурации сотни, листать их окном бессмысленно: по мере ввода
// подбираются подходящие по названию. Выбрать можно только из подобранного —
// имя, набранное с опечаткой, прятало бы действие молча.
&НаКлиенте
Процедура ПредставлениеОбъектаАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	Если СтрДлина(СокрЛП(Текст)) < 2 Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ВариантыОбъектовНаСервере(Текст);

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеОбъектаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)

	Если Не ЗначениеЗаполнено(СокрЛП(Текст)) Или Текст = ПредставлениеОбъекта Тогда
		Возврат;
	КонецЕсли;
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = ВариантыОбъектовНаСервере(Текст);

КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Строка") И СтрНайти(ВыбранноеЗначение, ".") > 0
		И ВыбранноеЗначение <> ПолноеИмяМетаданных Тогда
		УстановитьОбъектНаСервере(ВыбранноеЗначение);
	КонецЕсли;

КонецПроцедуры

// Без объекта у модели нет ни его файла, ни данных, а заполнять и записывать
// нечего: подставляем то, что без объекта имеет смысл.
&НаКлиенте
Процедура ТипМестаМастераПриИзменении(Элемент)

	Если ТипМестаМастера = "Глобально" Тогда
		ИсточникДанных = "Нет";
		РазрешитьПачку = Ложь;
		Если ВидРезультата = "ЗаполнитьФорму" Или ВидРезультата = "ЗаписатьОбъект" Тогда
			ВидРезультата = "СоздатьОбъект";
		КонецЕсли;
	КонецЕсли;
	ОбновитьШагОбъектНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура НазваниеПриИзменении(Элемент)

	Название = СокрЛП(Название);

КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхПриИзменении(Элемент)

	ОбновитьШагДанныеНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура РежимДиалогаПриИзменении(Элемент)

	Если РежимДиалога Тогда
		РазрешитьПачку = Ложь;
	КонецЕсли;
	ОбновитьШагДанныеНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ВидРезультатаПриИзменении(Элемент)

	ОбновитьШагРезультатНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура КартаИзвлеченияПриИзменении(Элемент)

	ОбновитьШагРезультатНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура РеквизитыПометкаПриИзменении(Элемент)

	ОбновитьСчетчикОтметок();

КонецПроцедуры

&НаКлиенте
Процедура РазрешитьПачкуПриИзменении(Элемент)

	ОбновитьШагДействиеНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОбразецСценарияПриИзменении(Элемент)

	ОбновитьШагДействиеНаСервере();

КонецПроцедуры

// Запрос, который администратор поправил руками, мастер больше не
// перегенерирует при смене объекта, источника данных или результата.
&НаКлиенте
Процедура НачальныйЗапросПриИзменении(Элемент)

	ЗапросИзменен = ЗначениеЗаполнено(СокрЛП(НачальныйЗапрос));

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДалееОбработка(Команда)

	Ошибка = ДалееНаСервере();
	Если ЗначениеЗаполнено(Ошибка) Тогда
		ПоказатьПредупреждение(, Ошибка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура НазадОбработка(Команда)

	НазадНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбработка(Команда)

	Ошибка = СоздатьНаСервере();
	Если ЗначениеЗаполнено(Ошибка) Тогда
		ПоказатьПредупреждение(, Ошибка);
		Возврат;
	КонецЕсли;
	// Открытые списки мест, карт и сценариев должны увидеть новые элементы.
	ОповеститьОбИзменении(МестоЗапуска);
	Если ЗначениеЗаполнено(СозданнаяКарта) Тогда
		ОповеститьОбИзменении(СозданнаяКарта);
	КонецЕсли;
	ОповеститьОбИзменении(СозданныйСценарий);

КонецПроцедуры

&НаКлиенте
Процедура ОтметитьВсеОбработка(Команда)

	УстановитьОтметки(Истина);

КонецПроцедуры

&НаКлиенте
Процедура СнятьОтметкиОбработка(Команда)

	УстановитьОтметки(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ПодключитьКомандуКОбъектуОбработка(Команда)

	Ошибка = ПодключитьКомандуНаСервере();
	Если ЗначениеЗаполнено(Ошибка) Тогда
		ПоказатьПредупреждение(, Ошибка);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьМестоЗапускаОбработка(Команда)

	ПоказатьЗначение(, МестоЗапуска);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКартуОбработка(Команда)

	Если ЗначениеЗаполнено(СозданнаяКарта) Тогда
		ПоказатьЗначение(, СозданнаяКарта);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСценарийОбработка(Команда)

	ПоказатьЗначение(, СозданныйСценарий);

КонецПроцедуры

&НаКлиенте
Процедура ЕщеДействиеОбработка(Команда)

	ЕщеДействиеНаСервере();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Шаги

// Проверяет ответы текущего шага и переходит к следующему. Возвращает текст
// ошибки: пока ответ не годится, дальше не пускаем — иначе ошибка всплывет
// только в итоге, и искать ее придется по всем шагам.
&НаСервере
Функция ДалееНаСервере()

	Шаг = Элементы.Шаги.ТекущаяСтраница;
	Если Шаг = Элементы.ШагОбъект Тогда
		Если Не ЗначениеЗаполнено(ПолноеИмяМетаданных) Тогда
			Возврат "Выберите объект, с которым работает действие.";
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СокрЛП(Название)) Тогда
			Возврат "Введите название действия — так будет подписана команда у пользователя.";
		КонецЕсли;
		ПоказатьШаг(Элементы.ШагДанные);

	ИначеЕсли Шаг = Элементы.ШагДанные Тогда
		Если ТипМестаМастера = "Глобально" И ИсточникДанных <> "Нет" Тогда
			Возврат "Без объекта у модели нет ни файла, ни данных объекта: выберите «Ничего, кроме того,"
				+ " что расскажет пользователь».";
		КонецЕсли;
		Если ИсточникДанных = "Данные"
			И ДанныеДляМодели.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество() = 0 Тогда
			Возврат "Отметьте, какие данные объекта передать модели.";
		КонецЕсли;
		Если ИсточникДанных = "Файл"
			И Не ЗначениеЗаполнено(Обработки.AI_НовоеДействие.ПредставлениеХраненияФайлов(ПолноеИмяМетаданных)) Тогда
			Возврат "Не удалось определить, где конфигурация хранит файлы этого объекта — выберите другой источник.";
		КонецЕсли;
		ПоказатьШаг(Элементы.ШагРезультат);

	ИначеЕсли Шаг = Элементы.ШагРезультат Тогда
		Если ТипМестаМастера = "Глобально"
			И (ВидРезультата = "ЗаполнитьФорму" Или ВидРезультата = "ЗаписатьОбъект") Тогда
			Возврат "Без объекта заполнять и записывать нечего: выберите «Создать новый объект»,"
				+ " «Только показать» или «Ответ текстом».";
		КонецЕсли;
		Если ВидРезультата <> "Текст" И Не ЗначениеЗаполнено(КартаИзвлечения)
			И Реквизиты.НайтиСтроки(Новый Структура("Пометка", Истина)).Количество() = 0 Тогда
			Возврат "Отметьте хотя бы одно поле или выберите готовую карту.";
		КонецЕсли;
		ПоказатьШаг(Элементы.ШагДействие);

	ИначеЕсли Шаг = Элементы.ШагДействие Тогда
		Проверка = Обработки.AI_НовоеДействие.ПроверитьОписание(ОписаниеДействия());
		Если Проверка.Ошибки.Количество() > 0 Тогда
			Возврат СтрСоединить(Проверка.Ошибки, Символы.ПС);
		КонецЕсли;
		ПоказатьШаг(Элементы.ШагИтог);
	КонецЕсли;
	Возврат "";

КонецФункции

&НаСервере
Процедура НазадНаСервере()

	Шаг = Элементы.Шаги.ТекущаяСтраница;
	Если Шаг = Элементы.ШагДанные Тогда
		ПоказатьШаг(Элементы.ШагОбъект);
	ИначеЕсли Шаг = Элементы.ШагРезультат Тогда
		ПоказатьШаг(Элементы.ШагДанные);
	ИначеЕсли Шаг = Элементы.ШагДействие Тогда
		ПоказатьШаг(Элементы.ШагРезультат);
	ИначеЕсли Шаг = Элементы.ШагИтог Тогда
		ПоказатьШаг(Элементы.ШагДействие);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПоказатьШаг(Страница)

	Элементы.Шаги.ТекущаяСтраница = Страница;
	Первый = (Страница = Элементы.ШагОбъект);
	Итог = (Страница = Элементы.ШагИтог);
	Готово = (Страница = Элементы.ШагГотово);
	Элементы.КнопкаНазад.Видимость = Не Первый И Не Готово;
	Элементы.КнопкаДалее.Видимость = Не Итог И Не Готово;
	Элементы.КнопкаСоздать.Видимость = Итог;
	// Основная кнопка шага — та, что ведет вперед: Enter не должен ничего
	// создавать, пока администратор не дошел до итога.
	Если Итог Тогда
		Элементы.КнопкаДалее.КнопкаПоУмолчанию = Ложь;
		Элементы.КнопкаСоздать.КнопкаПоУмолчанию = Истина;
	Иначе
		Элементы.КнопкаСоздать.КнопкаПоУмолчанию = Ложь;
		Элементы.КнопкаДалее.КнопкаПоУмолчанию = Истина;
	КонецЕсли;

	Если Первый Тогда
		ОбновитьШагОбъект();
	ИначеЕсли Страница = Элементы.ШагДанные Тогда
		ОбновитьШагДанные();
	ИначеЕсли Страница = Элементы.ШагРезультат Тогда
		ОбновитьШагРезультат();
	ИначеЕсли Страница = Элементы.ШагДействие Тогда
		ОбновитьШагДействие();
	ИначеЕсли Итог Тогда
		ОбновитьИтог();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ШагОбъект

&НаСервереБезКонтекста
Функция ВариантыОбъектовНаСервере(Отбор = "")

	Возврат AI_ИнтерфейсныеСценарии.ВариантыОбъектовМетаданных(Отбор);

КонецФункции

&НаСервере
Процедура УстановитьОбъектНаСервере(Имя)

	УстановитьОбъект(Имя);
	ОбновитьШагОбъект();

КонецПроцедуры

&НаСервере
Процедура ОбновитьШагОбъектНаСервере()

	ОбновитьШагОбъект();

КонецПроцедуры

// Смена объекта сбрасывает все, что от него зависит: реквизиты, данные для
// модели, карту и запрос по умолчанию.
&НаСервере
Процедура УстановитьОбъект(Имя)

	ПолноеИмяМетаданных = СокрЛП(Имя);
	ПредставлениеОбъекта = AI_ИнтерфейсныеСценарии.ПредставлениеОбъектаМетаданных(ПолноеИмяМетаданных);
	Если Не ЗначениеЗаполнено(Название) Тогда
		Название = "Заполнить по файлу";
	КонецЕсли;

	ЗаполнитьРеквизиты();
	ЗаполнитьДанныеДляМодели();
	Если ЗначениеЗаполнено(КартаИзвлечения)
		И СокрЛП(КартаИзвлечения.ПолноеИмяМетаданных) <> ПолноеИмяМетаданных Тогда
		КартаИзвлечения = Справочники.AI_КартыИзвлечения.ПустаяСсылка();
	КонецЕсли;
	// Выбирать есть смысл только из карт этого объекта.
	ПараметрыВыбора = Новый Массив;
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.ПолноеИмяМетаданных", ПолноеИмяМетаданных));
	ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Активна", Истина));
	Элементы.КартаИзвлечения.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);

	ОбновитьЗапросПоУмолчанию();

КонецПроцедуры

// Что уже настроено для объекта (или без объекта): второе действие с тем же
// смыслом только путает пользователя.
&НаСервере
Процедура ОбновитьШагОбъект()

	Если Не ЗначениеЗаполнено(ПолноеИмяМетаданных) И ТипМестаМастера <> "Глобально" Тогда
		Элементы.ДействияОбъекта.Заголовок = "";
		Возврат;
	КонецЕсли;
	Действия = Обработки.AI_НовоеДействие.ДействияОбъекта(ПолноеИмяМетаданных, ТипМестаМастера);
	Где = ?(ТипМестаМастера = "Глобально", "В помощнике раздела LLM", "Для этого объекта");
	Если Действия.Количество() = 0 Тогда
		Элементы.ДействияОбъекта.Заголовок = Где + " действий помощника еще нет.";
		Возврат;
	КонецЕсли;
	Строки = Новый Массив;
	Строки.Добавить(Где + " уже настроено:");
	Для Каждого Действие Из Действия Цикл
		Признаки = Новый Массив;
		Признаки.Добавить(НРег(Строка(Действие.ВидДействия)));
		Если Действие.Пачка Тогда
			Признаки.Добавить("пачкой");
		КонецЕсли;
		Если Не Действие.Активно Тогда
			Признаки.Добавить("выключено");
		КонецЕсли;
		Строки.Добавить(СтрШаблон("• «%1» — %2", Действие.ПредставлениеКоманды, СтрСоединить(Признаки, ", ")));
	КонецЦикла;
	Элементы.ДействияОбъекта.Заголовок = СтрСоединить(Строки, Символы.ПС);

КонецПроцедуры

#КонецОбласти

#Область ШагДанные

// Что объекта можно передать модели: каждый реквизит шапки отдельно и
// табличные части целиком — с номерами строк.
&НаСервере
Процедура ЗаполнитьДанныеДляМодели()

	ДанныеДляМодели.Очистить();
	Состав = AI_ИзвлечениеРеквизитов.ВариантыДанныхОбъекта(ПолноеИмяМетаданных);
	Для Каждого Часть Из Состав.ТабличныеЧасти Цикл
		НоваяСтрока = ДанныеДляМодели.Добавить();
		НоваяСтрока.Представление = Часть.Представление + " — все колонки";
		НоваяСтрока.Где = "табличная часть";
		НоваяСтрока.ТабличнаяЧасть = Часть.Имя;
		НоваяСтрока.ПутьРеквизита = "*";
	КонецЦикла;
	Для Каждого Реквизит Из Состав.Реквизиты Цикл
		НоваяСтрока = ДанныеДляМодели.Добавить();
		НоваяСтрока.Представление = Реквизит.Представление;
		НоваяСтрока.Где = "реквизит";
		НоваяСтрока.ПутьРеквизита = Реквизит.Имя;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьШагДанныеНаСервере()

	ОбновитьШагДанные();

КонецПроцедуры

&НаСервере
Процедура ОбновитьШагДанные()

	Глобально = (ТипМестаМастера = "Глобально");
	Элементы.ИсточникДанных.ТолькоПросмотр = Глобально;
	Элементы.ДанныеДляМодели.Видимость = (ИсточникДанных = "Данные");

	Элементы.ПояснениеФайла.ЦветТекста = Новый Цвет;
	Если Глобально Тогда
		Элементы.ПояснениеФайла.Заголовок = "Действие без объекта: модель знает только то, что расскажет"
			+ " пользователь, — обычно это разговор.";
	ИначеЕсли ИсточникДанных = "Файл" Тогда
		Хранение = Обработки.AI_НовоеДействие.ПредставлениеХраненияФайлов(ПолноеИмяМетаданных);
		Если ЗначениеЗаполнено(Хранение) Тогда
			Элементы.ПояснениеФайла.Заголовок = Хранение;
		Иначе
			Элементы.ПояснениеФайла.Заголовок = "Не удалось определить, где конфигурация хранит файлы"
				+ " этого объекта. Выберите другой источник — вопрос о файле можно настроить потом в месте запуска.";
			Элементы.ПояснениеФайла.ЦветТекста = ЦветПредупреждения();
		КонецЕсли;
	ИначеЕсли ИсточникДанных = "Данные" Тогда
		Элементы.ПояснениеФайла.Заголовок = "Отмеченное уйдет модели текстом, табличные части — таблицами"
			+ " с номером строки. Объект читается с правами пользователя, до 300 строк на табличную часть.";
	Иначе
		Элементы.ПояснениеФайла.Заголовок = "Модель увидит только представление объекта и то, что скажет"
			+ " пользователь. Реквизиты она найдет, только если у агента есть доступ к данным базы.";
	КонецЕсли;

	Если РежимДиалога Тогда
		Элементы.ПояснениеДиалога.Заголовок = "Помощник откроет разговор: модель сама спросит о нужных полях,"
			+ " пользователь отвечает словами. Результат формируется кнопкой «Сформировать результат» и"
			+ " дальше обрабатывается как обычно. Пачкой такое действие не запускается.";
	Иначе
		Элементы.ПояснениеДиалога.Заголовок = "Без разговора помощник сразу отправит запрос модели"
			+ " и покажет результат.";
	КонецЕсли;

	ОбновитьЗапросПоУмолчанию();

КонецПроцедуры

#КонецОбласти

#Область ШагРезультат

// Кандидаты — наименование, реквизиты шапки, доп. реквизиты и колонки
// табличных частей: то, что карта умеет заполнить.
&НаСервере
Процедура ЗаполнитьРеквизиты()

	Реквизиты.Очистить();
	Малые = Новый Соответствие;
	Для Каждого Кандидат Из AI_ИзвлечениеРеквизитов.КандидатыПолейКарты(ПолноеИмяМетаданных, Истина) Цикл
		НоваяСтрока = Реквизиты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Кандидат);
		Если ЗначениеЗаполнено(Кандидат.ТабличнаяЧасть) Тогда
			НоваяСтрока.Где = "строки: " + СтрРазделить(Кандидат.Представление, ":")[0];
		ИначеЕсли ЗначениеЗаполнено(Кандидат.ДополнительныйРеквизит) Тогда
			НоваяСтрока.Где = "доп. реквизит";
		Иначе
			НоваяСтрока.Где = "реквизит";
		КонецЕсли;
		НоваяСтрока.ТипПредставление = ПредставлениеТипа(Кандидат.ТипЗначения, Кандидат.ТипСсылки);
		// Небольшой справочник (пользователи, виды) модель выбирает из
		// существующих — по умолчанию так и настраиваем, снять можно здесь же.
		Если Кандидат.ТипЗначения = Перечисления.AI_ТипЗначенияПоля.Ссылка
			И Не ЗначениеЗаполнено(Кандидат.ДополнительныйРеквизит) Тогда
			НоваяСтрока.ВыбиратьИзСписка = СправочникиНебольшие(Кандидат.ТипСсылки, Малые);
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ОбновитьШагРезультатНаСервере()

	ОбновитьШагРезультат();

КонецПроцедуры

// С готовой картой отметки не нужны — таблица только для справки. При ответе
// текстом полей нет вовсе.
&НаСервере
Процедура ОбновитьШагРезультат()

	Текстом = (ВидРезультата = "Текст");
	Элементы.КартаИзвлечения.Видимость = Не Текстом;
	Элементы.ПояснениеКарты.Видимость = Не Текстом;
	Элементы.ГруппаОтметки.Видимость = Не Текстом;
	Элементы.Реквизиты.Видимость = Не Текстом;
	Элементы.Реквизиты.ТолькоПросмотр = ЗначениеЗаполнено(КартаИзвлечения);
	Элементы.ПанельРеквизитов.Доступность = Не ЗначениеЗаполнено(КартаИзвлечения);

	Если Текстом Тогда
		Элементы.РежимСтрок.Видимость = Ложь;
	ИначеЕсли ЗначениеЗаполнено(КартаИзвлечения) Тогда
		Названия = Новый Массив;
		Для Каждого Поле Из КартаИзвлечения.Поля Цикл
			Названия.Добавить(Поле.Представление);
		КонецЦикла;
		Текст = СтрШаблон("Будут использованы поля карты «%1» (%2): %3. Отметки в таблице не нужны.",
			КартаИзвлечения, Названия.Количество(), СтрСоединить(Названия, ", "));
		Сценарий = Обработки.AI_НовоеДействие.СценарийКарты(КартаИзвлечения);
		Если ЗначениеЗаполнено(Сценарий) Тогда
			Текст = Текст + СтрШаблон(" Карта уже работает со сценарием «%1» — он и будет использован.", Сценарий);
		КонецЕсли;
		Элементы.ПояснениеКарты.Заголовок = Текст;
		Элементы.РежимСтрок.Видимость = Ложь;
	ИначеЕсли Реквизиты.Количество() = 0 Тогда
		Элементы.ПояснениеКарты.Заголовок = "У объекта нет полей, которые карта умеет заполнять:"
			+ " строк, чисел, дат, флажков и ссылок на справочники и перечисления.";
	Иначе
		Элементы.ПояснениеКарты.Заголовок = "Оставьте пустым — карта будет создана по отмеченным полям."
			+ " «Из существующих» — модель выбирает значение из справочника, а не пишет как в документе.";
	КонецЕсли;
	ОбновитьСчетчикОтметокНаСервере();
	ОбновитьЗапросПоУмолчанию();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтметки(Пометка)

	Для Каждого СтрокаРеквизита Из Реквизиты Цикл
		СтрокаРеквизита.Пометка = Пометка;
	КонецЦикла;
	ОбновитьСчетчикОтметок();

КонецПроцедуры

// Счетчик отметок и выбор режима строк: он нужен, только если отмечена
// колонка табличной части.
&НаКлиенте
Процедура ОбновитьСчетчикОтметок()

	Отмечено = 0;
	ЕстьСтроки = Ложь;
	Для Каждого СтрокаРеквизита Из Реквизиты Цикл
		Если СтрокаРеквизита.Пометка Тогда
			Отмечено = Отмечено + 1;
			ЕстьСтроки = ЕстьСтроки Или ЗначениеЗаполнено(СтрокаРеквизита.ТабличнаяЧасть);
		КонецЕсли;
	КонецЦикла;
	Элементы.ОтмеченоРеквизитов.Заголовок = ТекстОтмечено(Отмечено, Реквизиты.Количество());
	Элементы.РежимСтрок.Видимость = ЕстьСтроки И ВидРезультата <> "Текст" И Не ЗначениеЗаполнено(КартаИзвлечения);

КонецПроцедуры

&НаСервере
Процедура ОбновитьСчетчикОтметокНаСервере()

	Отмеченные = Реквизиты.НайтиСтроки(Новый Структура("Пометка", Истина));
	ЕстьСтроки = Ложь;
	Для Каждого СтрокаРеквизита Из Отмеченные Цикл
		ЕстьСтроки = ЕстьСтроки Или ЗначениеЗаполнено(СтрокаРеквизита.ТабличнаяЧасть);
	КонецЦикла;
	Элементы.ОтмеченоРеквизитов.Заголовок = ТекстОтмечено(Отмеченные.Количество(), Реквизиты.Количество());
	Элементы.РежимСтрок.Видимость = ЕстьСтроки И ВидРезультата <> "Текст" И Не ЗначениеЗаполнено(КартаИзвлечения);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТекстОтмечено(Отмечено, Всего)

	Возврат СтрШаблон("Отмечено: %1 из %2", Отмечено, Всего);

КонецФункции

&НаСервереБезКонтекста
Функция ПредставлениеТипа(ТипЗначения, ТипСсылки)

	Виды = Перечисления.AI_ТипЗначенияПоля;
	Если ТипЗначения = Виды.Ссылка Тогда
		Названия = Новый Массив;
		Для Каждого Часть Из СтрРазделить(ТипСсылки, ",", Ложь) Цикл
			ОписаниеСсылки = Метаданные.НайтиПоПолномуИмени(СокрЛП(Часть));
			Названия.Добавить(?(ОписаниеСсылки = Неопределено, СокрЛП(Часть), ОписаниеСсылки.Синоним));
		КонецЦикла;
		Возврат СтрСоединить(Названия, " или ");
	ИначеЕсли ТипЗначения = Виды.Число Тогда
		Возврат "число";
	ИначеЕсли ТипЗначения = Виды.Дата Тогда
		Возврат "дата";
	ИначеЕсли ТипЗначения = Виды.Булево Тогда
		Возврат "да/нет";
	КонецЕсли;
	Возврат "строка";

КонецФункции

// Все справочники поля — не больше ста элементов: из такого перечня модель
// выбирает надежно. Перечисления маленькие всегда.
&НаСервереБезКонтекста
Функция СправочникиНебольшие(ТипСсылки, Проверенные)

	Для Каждого Часть Из СтрРазделить(ТипСсылки, ",", Ложь) Цикл
		ПолноеИмя = СокрЛП(Часть);
		Ответ = Проверенные.Получить(ПолноеИмя);
		Если Ответ = Неопределено Тогда
			ОписаниеСсылки = Метаданные.НайтиПоПолномуИмени(ПолноеИмя);
			Если ОписаниеСсылки = Неопределено Тогда
				Ответ = Ложь;
			ИначеЕсли Метаданные.Перечисления.Содержит(ОписаниеСсылки) Тогда
				Ответ = Истина;
			Иначе
				Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 101 1 КАК Поле ИЗ " + ПолноеИмя + " КАК Значения");
				Ответ = Запрос.Выполнить().Выбрать().Количество() <= 100;
			КонецЕсли;
			Проверенные.Вставить(ПолноеИмя, Ответ);
		КонецЕсли;
		Если Не Ответ Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	Возврат Истина;

КонецФункции

#КонецОбласти

#Область ШагДействие

&НаСервере
Процедура ОбновитьШагДействиеНаСервере()

	ОбновитьШагДействие();

КонецПроцедуры

&НаСервере
Процедура ОбновитьШагДействие()

	// Пачка — только из списка объектов и только без разговора.
	Элементы.РазрешитьПачку.Видимость = (ТипМестаМастера <> "Глобально") И Не РежимДиалога;
	Если Не Элементы.РазрешитьПачку.Видимость Тогда
		РазрешитьПачку = Ложь;
	КонецЕсли;
	Если РазрешитьПачку Тогда
		Элементы.ПояснениеПачки.Заголовок = "Выделите несколько объектов в списке и вызовите помощника:"
			+ " по каждому объекту будет своя операция в очереди, результаты открываются из списка пачки.";
	ИначеЕсли РежимДиалога Тогда
		Элементы.ПояснениеПачки.Заголовок = "Действие с разговором запускается по одному объекту.";
	Иначе
		Элементы.ПояснениеПачки.Заголовок = "Действие будет доступно по одному объекту.";
	КонецЕсли;
	Элементы.ПредупреждениеПачки.Заголовок = AI_ИнтерфейсныеСценарии.ТекстПачкаБезФормы();
	Элементы.ПредупреждениеПачки.Видимость = РазрешитьПачку И ВидРезультата = "ЗаполнитьФорму";

	// Сценарий: у готовой карты — ее собственный, иначе копия образца.
	Описание = ОписаниеДействия();
	НуженНовый = Обработки.AI_НовоеДействие.НуженНовыйСценарий(Описание);
	Элементы.ОбразецСценария.Видимость = НуженНовый;
	Если Не НуженНовый Тогда
		СценарийКарты = Обработки.AI_НовоеДействие.СценарийКарты(КартаИзвлечения);
		Элементы.ПояснениеСценария.Заголовок = СтрШаблон("Карта уже работает со сценарием «%1» —"
			+ " он и будет использован: агент «%2», модель «%3».",
			СценарийКарты, СценарийКарты.Агент, СценарийКарты.Модель);
	ИначеЕсли ЗначениеЗаполнено(ОбразецСценария) Тогда
		Элементы.ПояснениеСценария.Заголовок = СтрШаблон("Будет создан сценарий «%1» с тем же агентом"
			+ " «%2» и моделью «%3»%4. Действие увидят пользователи с доступом к этому агенту.",
			СокрЛП(Название), ОбразецСценария.Агент, ОбразецСценария.Модель,
			?(ВидРезультата = "Текст", "", "; схема ответа — по карте"));
	Иначе
		Элементы.ПояснениеСценария.Заголовок = "Выберите сценарий, из которого взять агента и модель."
			+ " Если сценариев еще нет, заведите первый в «Сценарии прикладных вызовов».";
	КонецЕсли;

	ОбновитьЗапросПоУмолчанию();

КонецПроцедуры

&НаСервере
Процедура ОбновитьЗапросПоУмолчанию()

	Если Не ЗапросИзменен Тогда
		НачальныйЗапрос = Обработки.AI_НовоеДействие.ТекстЗапросаПоУмолчанию(
			ПолноеИмяМетаданных, ИсточникДанных, РежимДиалога, ВидРезультата);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Итог

// Итог перечисляет, что появится в базе, и честно говорит, чего еще не хватит.
&НаСервере
Процедура ОбновитьИтог()

	Описание = ОписаниеДействия();
	Строки = Новый Массив;
	Строки.Добавить("Будет создано:");

	Если Описание.ОтветТекстом Тогда
		Строки.Добавить("• карта не нужна — модель отвечает текстом;");
	ИначеЕсли ЗначениеЗаполнено(КартаИзвлечения) Тогда
		Строки.Добавить(СтрШаблон("• карта не создается — используется «%1» (%2 полей);",
			КартаИзвлечения, КартаИзвлечения.Поля.Количество()));
	Иначе
		Названия = Новый Массив;
		Для Каждого Поле Из Описание.Поля Цикл
			Названия.Добавить(Поле.Представление);
		КонецЦикла;
		Строки.Добавить(СтрШаблон("• карта извлечения «%1»: %2;", Описание.Наименование, СтрСоединить(Названия, ", ")));
	КонецЕсли;

	Если Обработки.AI_НовоеДействие.НуженНовыйСценарий(Описание) Тогда
		Агент = ОбразецСценария.Агент;
		Строки.Добавить(СтрШаблон("• сценарий «%1» — агент «%2», модель «%3», как в «%4»;",
			Описание.Наименование, ОбразецСценария.Агент, ОбразецСценария.Модель, ОбразецСценария));
	Иначе
		СценарийКарты = Обработки.AI_НовоеДействие.СценарийКарты(КартаИзвлечения);
		Агент = СценарийКарты.Агент;
		Строки.Добавить(СтрШаблон("• сценарий не создается — используется «%1»;", СценарийКарты));
	КонецЕсли;

	Детали = Новый Массив;
	Если РежимДиалога Тогда
		Детали.Добавить("сначала разговор");
	КонецЕсли;
	Если ИсточникДанных = "Файл" Тогда
		Детали.Добавить("спросит файл объекта");
	ИначеЕсли ИсточникДанных = "Данные" Тогда
		Детали.Добавить("передаст модели данные объекта");
	КонецЕсли;
	Детали.Добавить(ОписаниеРезультата());
	Если РазрешитьПачку Тогда
		Детали.Добавить("можно пачкой из списка");
	КонецЕсли;
	Строки.Добавить(СтрШаблон("• место запуска «%1» %2: %3.",
		Описание.Наименование,
		?(ТипМестаМастера = "Глобально", "в AI-помощнике раздела LLM", "в карточке «" + ПредставлениеОбъекта + "»"),
		СтрСоединить(Детали, ", ")));
	Строки.Добавить("");
	Строки.Добавить(СтрШаблон("Команду увидят пользователи с доступом к агенту «%1».", Агент));
	Элементы.ТекстИтога.Заголовок = СтрСоединить(Строки, Символы.ПС);

	Проверка = Обработки.AI_НовоеДействие.ПроверитьОписание(Описание);
	Предупреждения = Новый Массив;
	Для Каждого Текст Из Проверка.Предупреждения Цикл
		Предупреждения.Добавить("• " + Текст);
	КонецЦикла;
	Элементы.ТекстПредупреждений.Заголовок = СтрСоединить(Предупреждения, Символы.ПС);
	Элементы.ТекстПредупреждений.Видимость = Предупреждения.Количество() > 0;

	ОбновитьПодключениеКоманды();

КонецПроцедуры

&НаСервере
Функция ОписаниеРезультата()

	Если ВидРезультата = "ЗаполнитьФорму" Тогда
		Возврат "заполнит форму";
	ИначеЕсли ВидРезультата = "ЗаписатьОбъект" Тогда
		Возврат "запишет в объект";
	ИначеЕсли ВидРезультата = "СоздатьОбъект" Тогда
		Возврат "создаст новый объект";
	ИначеЕсли ВидРезультата = "Текст" Тогда
		Возврат "ответит текстом";
	КонецЕсли;
	Возврат "только покажет значения";

КонецФункции

// Команда помощника появляется в карточке, только если обработка БСП
// назначена на объект. Мастер предлагает сделать это сразу. Действию без
// объекта обработка не нужна — оно видно в помощнике раздела LLM.
&НаСервере
Процедура ОбновитьПодключениеКоманды()

	Элементы.ПодключитьКоманду.Видимость = Ложь;
	ПодключитьКоманду = Ложь;
	Элементы.ПояснениеКоманды.ЦветТекста = Новый Цвет;
	Если ТипМестаМастера = "Глобально" Тогда
		Элементы.ПояснениеКоманды.Заголовок = "Действие будет в AI-помощнике раздела LLM"
			+ " (Работа с агентами → AI-помощник).";
		Возврат;
	КонецЕсли;
	Если Метаданные.Справочники.Найти("ДополнительныеОтчетыИОбработки") = Неопределено Тогда
		Элементы.ПояснениеКоманды.Заголовок = "Команду помощника в карточку объекта добавляет интеграция"
			+ " конфигурации — см. docs/universal-ui-integration.md.";
		Возврат;
	КонецЕсли;

	Регистрация = AI_ИнтерфейсныеСценарии.РегистрацияОбработкиБСП();
	Если Регистрация = Неопределено Тогда
		Элементы.ПояснениеКоманды.Заголовок = "Обработка «AI-помощник» не зарегистрирована в дополнительных"
			+ " отчетах и обработках — команды помощника в карточках нет. Сохраните ее командой"
			+ " «Сохранить обработку для БСП» в помощнике и зарегистрируйте.";
		Элементы.ПояснениеКоманды.ЦветТекста = ЦветПредупреждения();
	ИначеЕсли Не Регистрация.Используется Тогда
		Элементы.ПояснениеКоманды.Заголовок = СтрШаблон("Регистрация обработки «%1» отключена —"
			+ " команды помощника в карточках нет.", Регистрация.Наименование);
		Элементы.ПояснениеКоманды.ЦветТекста = ЦветПредупреждения();
	ИначеЕсли Регистрация.Назначение.Найти(ПолноеИмяМетаданных) <> Неопределено Тогда
		Элементы.ПояснениеКоманды.Заголовок = СтрШаблон("Команда помощника в карточке «%1» уже есть.",
			ПредставлениеОбъекта);
	Иначе
		МожноМенять = ПравоДоступа("Изменение", Метаданные.Справочники.Найти("ДополнительныеОтчетыИОбработки"));
		Элементы.ПодключитьКоманду.Видимость = МожноМенять;
		ПодключитьКоманду = МожноМенять;
		Элементы.ПояснениеКоманды.Заголовок = СтрШаблон("Обработка «%1» не назначена на «%2» —"
			+ " без этого команды помощника в карточке не будет.%3",
			Регистрация.Наименование, ПредставлениеОбъекта,
			?(МожноМенять, "", " Назначить ее может администратор БСП."));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область Создание

&НаСервере
Функция СоздатьНаСервере()

	Попытка
		Результат = Обработки.AI_НовоеДействие.СоздатьДействие(ОписаниеДействия());
	Исключение
		Возврат "Действие не создано: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	МестоЗапуска = Результат.МестоЗапуска;
	СозданнаяКарта = Результат.КартаИзвлечения;
	СозданныйСценарий = Результат.Сценарий;
	Элементы.СсылкаКарта.Видимость = ЗначениеЗаполнено(СозданнаяКарта);

	Строки = Новый Массив;
	Строки.Добавить("Готово. Сделано:");
	Для Каждого Текст Из Результат.Создано Цикл
		Строки.Добавить("• " + Текст);
	КонецЦикла;
	Элементы.ТекстГотово.Заголовок = СтрСоединить(Строки, Символы.ПС);
	ПоказатьПроблемы(Результат.Проблемы, Результат.МожноНазначитьОбработку);
	ПоказатьШаг(Элементы.ШагГотово);
	Возврат "";

КонецФункции

&НаСервере
Функция ПодключитьКомандуНаСервере()

	Попытка
		AI_ИнтерфейсныеСценарии.НазначитьОбработкуБСП(ПолноеИмяМетаданных);
	Исключение
		Возврат "Не удалось подключить команду: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	Состояние = AI_ИнтерфейсныеСценарии.ПроблемыНастройкиМеста(МестоЗапуска);
	ПоказатьПроблемы(Состояние.Проблемы, Состояние.МожноНазначитьОбработку);
	Возврат "";

КонецФункции

&НаСервере
Процедура ПоказатьПроблемы(Проблемы, МожноНазначитьОбработку)

	Если Проблемы.Количество() = 0 Тогда
		Где = ?(ТипМестаМастера = "Глобально",
			"Откройте AI-помощник в разделе LLM",
			СтрШаблон("Откройте карточку «%1», вызовите помощника", ПредставлениеОбъекта));
		Элементы.ТекстПроблем.Заголовок = СтрШаблон("Настройка в порядке. %1 и выберите «%2».",
			Где, СокрЛП(Название));
		Элементы.ТекстПроблем.ЦветТекста = Новый Цвет(0, 110, 40);
	Иначе
		Строки = Новый Массив;
		Строки.Добавить("Что еще мешает действию:");
		Для Каждого Проблема Из Проблемы Цикл
			Строки.Добавить("• " + Проблема);
		КонецЦикла;
		Элементы.ТекстПроблем.Заголовок = СтрСоединить(Строки, Символы.ПС);
		Элементы.ТекстПроблем.ЦветТекста = ЦветПредупреждения();
	КонецЕсли;
	Элементы.КнопкаПодключитьКоманду.Видимость = МожноНазначитьОбработку;

КонецПроцедуры

// Следующее действие чаще всего заводят для того же объекта и на том же
// образце — их оставляем, остальное начинаем заново.
&НаСервере
Процедура ЕщеДействиеНаСервере()

	Название = "";
	КартаИзвлечения = Справочники.AI_КартыИзвлечения.ПустаяСсылка();
	МестоЗапуска = Справочники.AI_МестаЗапускаСценариев.ПустаяСсылка();
	СозданнаяКарта = Справочники.AI_КартыИзвлечения.ПустаяСсылка();
	СозданныйСценарий = Справочники.AI_Сценарии.ПустаяСсылка();
	ЗапросИзменен = Ложь;
	Если ЗначениеЗаполнено(ПолноеИмяМетаданных) Тогда
		УстановитьОбъект(ПолноеИмяМетаданных);
	КонецЕсли;
	ПоказатьШаг(Элементы.ШагОбъект);

КонецПроцедуры

// Ответы мастера в том виде, в каком их принимает модуль менеджера.
&НаСервере
Функция ОписаниеДействия()

	Описание = Обработки.AI_НовоеДействие.НовоеОписание();
	Описание.ПолноеИмяМетаданных = ПолноеИмяМетаданных;
	Описание.ТипМеста = ТипМестаМастера;
	Описание.Наименование = СокрЛП(Название);
	Описание.ИсточникДанных = ИсточникДанных;
	Если ИсточникДанных = "Данные" Тогда
		Для Каждого СтрокаДанных Из ДанныеДляМодели.НайтиСтроки(Новый Структура("Пометка", Истина)) Цикл
			Описание.ДанныеОбъекта.Добавить(Новый Структура("ТабличнаяЧасть,ПутьРеквизита",
				СтрокаДанных.ТабличнаяЧасть, СтрокаДанных.ПутьРеквизита));
		КонецЦикла;
	КонецЕсли;
	Описание.РежимДиалога = РежимДиалога;
	Описание.ОтветТекстом = (ВидРезультата = "Текст");
	Описание.ВидДействия = ВидДействияПоРезультату(ВидРезультата);
	Описание.КартаИзвлечения = КартаИзвлечения;
	Если Не ЗначениеЗаполнено(КартаИзвлечения) И Не Описание.ОтветТекстом Тогда
		Для Каждого СтрокаРеквизита Из Реквизиты.НайтиСтроки(Новый Структура("Пометка", Истина)) Цикл
			Поле = Новый Структура("Представление,ТабличнаяЧасть,ПутьРеквизита,ДополнительныйРеквизит,ТипЗначения,"
				+ "ТипСсылки,ПоискПоНаименованию,Подсказка,ВыбиратьИзСписка");
			ЗаполнитьЗначенияСвойств(Поле, СтрокаРеквизита);
			Поле.Вставить("Обязательное", Ложь);
			Описание.Поля.Добавить(Поле);
		КонецЦикла;
	КонецЕсли;
	Описание.РежимСтрок = ?(ЗначениеЗаполнено(РежимСтрок), РежимСтрок, "Добавлять");
	Описание.РазрешитьПачку = РазрешитьПачку;
	Описание.ОбразецСценария = ОбразецСценария;
	Описание.НачальныйЗапрос = НачальныйЗапрос;
	Описание.Включить = Включить;
	Описание.ПодключитьКоманду = ПодключитьКоманду И Элементы.ПодключитьКоманду.Видимость;
	Возврат Описание;

КонецФункции

&НаСервереБезКонтекста
Функция ВидДействияПоРезультату(ВидРезультата)

	Виды = Перечисления.AI_ВидДействия;
	Если ВидРезультата = "ЗаполнитьФорму" Тогда
		Возврат Виды.ЗаполнитьФорму;
	ИначеЕсли ВидРезультата = "ЗаписатьОбъект" Тогда
		Возврат Виды.ЗаписатьОбъект;
	ИначеЕсли ВидРезультата = "СоздатьОбъект" Тогда
		Возврат Виды.СоздатьОбъект;
	КонецЕсли;
	Возврат Виды.ТолькоПоказать;

КонецФункции

&НаСервереБезКонтекста
Функция ВидРезультатаПоОписанию(Описание)

	Если Описание.ОтветТекстом Тогда
		Возврат "Текст";
	КонецЕсли;
	Виды = Перечисления.AI_ВидДействия;
	Если Описание.ВидДействия = Виды.ЗаписатьОбъект Тогда
		Возврат "ЗаписатьОбъект";
	ИначеЕсли Описание.ВидДействия = Виды.СоздатьОбъект Тогда
		Возврат "СоздатьОбъект";
	ИначеЕсли Описание.ВидДействия = Виды.ТолькоПоказать Тогда
		Возврат "ТолькоПоказать";
	КонецЕсли;
	Возврат "ЗаполнитьФорму";

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЦветПредупреждения()

	Возврат Новый Цвет(170, 40, 30);

КонецФункции

#КонецОбласти

#КонецОбласти
